Revit 2026 API

# MultiReferenceAnnotationFailures Properties

---

The BuiltInFailuresMultiReferenceAnnotationFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ElementCategoryChangeInvalidatesMultiReferenceAnnotation | Elements have changed category. Multi-rebar annotations for these elements are now of the wrong category and will be deleted. |
|  | MultiReferenceAnnotationReferenceCategoryForcesDeletion | Changing the reference category will cause instances of this annotation type to be deleted, because they no longer match their references. |

#### Reference

BuiltInFailuresMultiReferenceAnnotationFailures Class

Autodesk.Revit.DB Namespace